var empq = [];

empq.push({"type":"personal", "q":"Необходимость личной беседы", "a": 1});
empq.push({"type":"freeform", "q":"Пройденное обучение (корпоративное и самостоятельное)", "a": ""});

empq.push({"type":"header", "q":"Обратная связь"});
empq.push({"type":"header", "q":"Что является Вашими сильными сторонами?"});
empq.push({"type":"quality", "q":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"quality", "q":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"quality", "q":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"q":"Другое качество", "a": ""});

empq.push({"type":"header", "q":"Что хотелось бы подтянуть?"});
empq.push({"type":"quality", "q":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"quality", "q":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"quality", "q":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"q":"Другое качество ", "a": ""});

empq.push({"type":"header", "q":"В какой мере Вы удовлетворены следующими факторами в нашей компании?"});
empq.push({"type":"interest", "q":"Интересность работы (проекта)", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"correspond", "q":"Соответствие моей квалификации работе, которую я выполняю", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"prospects", "q":"Наличие перспектив должностного продвижения", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"myqualification", "q":"Моя квалификация за последний год", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"info", "q":"Информированность о делах коллектива и компании", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"workspace", "q":"Рабочее место", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"infra", "q":"Инфраструктура (кухня, уборка помещений, WC и т.д.)", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"salary", "q":"Заработная плата", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"feedback", "q":"Обратная связь от руководителя", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"help", "q":"Помощь и поддержка руководителя", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"relationship", "q":"Отношения с коллегами", "a": 1});
empq.push({"q":"Комментарий", "a": ""});

empq.push({"type":"header", "q":"События, проблемы, пожелания"});
empq.push({"q":"Какое событие прошедшего года, относящиеся к Вашей работе, является для Вас самым важным? ", "a": ""});
empq.push({"q":"Есть ли у Вас проблемы, связанные с текущими обязанностями? Какие?", "a": ""});
empq.push({"q":"Чему Вы хотели бы поучиться (посетить конференцию, семинар, тренинг, сертифицироваться, повысить квалификацию самостоятельно)?", "a": ""});
empq.push({"q":"Какие предложения по улучшению работы в компании Вы хотели бы предложить?", "a": ""});
empq.push({"q":"Какие факторы (три в порядке убывания значимости) наиболее часто вызывают у вас позитив/вдохновляют/помогают работе?", "a": ""});
empq.push({"q":"Какие факторы (три в порядке убывания значимости) наиболее часто раздражают/мешают работе? ", "a": ""});
empq.push({"type":"bonus", "q":"Какие льготы или поощрения Вы хотели бы получать в дополнение к заработной плате?", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"insurance", "q":"Довольны ли Вы качеством обслуживания нашей страховой компании (ДМС)?", "a": 1});
empq.push({"q":"Комментарий", "a": ""});

empq.push({"type":"desire", "q":"Есть ли у Вас желание (необходимость) изучать английский язык?", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"satisfied", "q":"Меня устраивает качество преподавания английского языка в нашей компании (и расписание)", "a": 1});
empq.push({"q":"Комментарий", "a": ""});

empq.push({"type":"desire", "q":"Есть ли у Вас желание (необходимость) изучать немецкий язык?", "a": 1});
empq.push({"q":"Комментарий", "a": ""});
empq.push({"type":"satisfied", "q":"Меня устраивает качество преподавания немецкий языка в нашей компании (и расписание)", "a": 1});
empq.push({"q":"Комментарий", "a": ""});

empq.push({"q":"Какие прочие темы Вы хотели бы поднять на аттестации? ", "a": ""});

var mgrq = [];
mgrq.push({"type":"header", "q":"Сильные стороны сотрудника"});
mgrq.push({"type":"quality", "q":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий", "a": ""});
mgrq.push({"type":"quality", "q":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий", "a": ""});
mgrq.push({"type":"quality", "q":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий", "a": ""});
mgrq.push({"q":"Другое качество", "a": ""});

mgrq.push({"type":"header", "q":"Качества сотрудника, которые стоило бы улучшить"});
mgrq.push({"type":"quality", "q":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий", "a": ""});
mgrq.push({"type":"quality", "q":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий", "a": ""});
mgrq.push({"type":"quality", "q":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий", "a": ""});
mgrq.push({"q":"Другое качество", "a": ""});

mgrq.push({"type": "loyality", "q":"Лояльность к компании", "a": 1});
mgrq.push({"type": "mgr_correspond", "q":"Соответствие сотрудника занимаемой должности", "a": 1});
mgrq.push({"type":"personal", "q":"Необходимость личной беседы", "a": 1});

mgrq.push({"type":"header", "q":"Рекомендации руководителя"});
mgrq.push({"q":"Комментарий", "a": ""});

mgrq.push({"type":"freeform", "q":"Решения и задачи на ближайший год", "a": ""});

var hrForm = [];
hrForm.push({"q":"Дата проведения", "a": ""});
// hrForm.push({"type":"freeform", "q":"Задачи на ближайший год", "a": ""});
//hrForm.push({"type":"freeform", "q":"Оценка выполнения персональных задач, поставленных на предыдущей аттестации", "a": ""});
hrForm.push({"type":"header", "q":"Решения:"});

hrForm.push({"type":"hr-results", 
	"a00":"Решения и задачи на ближайший год", "a01": "План выполнения и критерии оценки", "a02": "Ответственный",
	"a11":"", "a11": "", "a12": "",
	"a22":"", "a22": "", "a22": "",
	"a31":"", "a31": "", "a32": "",
	"a41":"", "a41": "", "a42": "",
	"a51":"", "a51": "", "a52": ""
});

var groups = [{"n":"c9","m":{"13":"Pomidor Senior"},"e":{"11":"Ivan Ivanov"}},{"n":"c9","m":{"13":"Pomidor Senior","11":"Ivan Ivanov"},"e":{"15":"Walle Walle"}}]

var body = {};
body['empForm'] = empq;
body['mgrForm'] = mgrq;
body['hrForm'] = hrForm;

var Event = Backbone.Model.extend({
    urlRoot: '/tercomin/api/v1/event'
});

var t = new Event
var evnt = {}
evnt['body'] = JSON.stringify(body);
evnt['name'] = "Аттестация 2014";
evnt['groups'] = JSON.stringify(groups);

t.set('event', evnt)
t.save()

///////////////////////////////
var t = new app.Event
var body = {};
body['empForm'] = {};
body['mgrForm'] = {};
var evnt = {}
evnt['body'] = JSON.stringify(body);
evnt['name'] = "Test 2014";
t.set('event', evnt)
t.save()


////////////////////////////// delete
var t = new app.Event
t.set('id', 1)
t.destroy()