var empq = [];
empq.push({"fq":"Оценка выполнения персональных задач, поставленных на предыдущей аттестации", "a": ""});
empq.push({"fq":"Пройденное обучение (корпоративное и самостоятельное)", "a": ""});
empq.push({"rq":"Необходимость личной беседы", "a": 1});
empq.push({"fq":"Задачи на ближайший год", "a": ""});
empq.push({"qh":"Обратная связь"});
empq.push({"qh":"Что является Вашими сильными сторонами?"});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"q":"Другое качество ", "a": ""});

empq.push({"qh":"Что хотелось бы подтянуть?"});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"q":"Другое качество ", "a": ""});

empq.push({"qh":"В какой мере Вы удовлетворены следующими факторами в нашей компании?"});
empq.push({"interest_q":"Интересность работы (проекта)", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"correspond_q":"Соответствие моей квалификации работе, которую я выполняю", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"prospects_q":"Наличие перспектив должностного продвижения", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"myqualification_q":"Моя квалификация за последний год", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"info_q":"Информированность о делах коллектива и компании", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"workspace_q":"Рабочее место", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"infra_q":"Инфраструктура (кухня, уборка помещений, WC и т.д.)", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"salary_q":"Заработная плата", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"feedback_q":"Обратная связь от руководителя", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"help_q":"Помощь и поддержка руководителя", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"relationship_q":"Отношения с коллегами", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});

empq.push({"qh":"События, проблемы, пожелания"});
empq.push({"q":"Какое событие прошедшего года, относящиеся к Вашей работе, является для Вас самым важным? ", "a": ""});
empq.push({"q":"Есть ли у Вас проблемы, связанные с текущими обязанностями? Какие?", "a": ""});
empq.push({"q":"Чему Вы хотели бы поучиться (посетить конференцию, семинар, тренинг, сертифицироваться, повысить квалификацию самостоятельно)?", "a": ""});
empq.push({"q":"Какие предложения по улучшению работы в компании Вы хотели бы предложить?", "a": ""});
empq.push({"q":"Какие факторы (три в порядке убывания значимости) наиболее часто вызывают у вас позитив/вдохновляют/помогают работе?", "a": ""});
empq.push({"q":"Какие факторы (три в порядке убывания значимости) наиболее часто раздражают/мешают работе? ", "a": ""});
empq.push({"bonus_q":"Какие льготы или поощрения Вы хотели бы получать в дополнение к заработной плате?", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"insurance_q":"Довольны ли Вы качеством обслуживания нашей страховой компании (ДМС)?", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});

empq.push({"desire_q":"Есть ли у Вас желание (необходимость) изучать английский язык?", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"satisfied_q":"Меня устраивает качество преподавания английского языка в нашей компании (и расписание)", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});

empq.push({"desire_q":"Есть ли у Вас желание (необходимость) изучать немецкий язык?", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"satisfied_q":"Меня устраивает качество преподавания немецкий языка в нашей компании (и расписание)", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});

empq.push({"q":"Какие прочие темы Вы хотели бы поднять на аттестации? ", "a": ""});

var mgrq = [];
mgrq.push({"qh":"Сильные стороны сотрудника"});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"q":"Другое качество ", "a": ""});

mgrq.push({"qh":"Качества сотрудника, которые стоило бы улучшить"});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"q":"Другое качество ", "a": ""});

mgrq.push({"lq":"Лояльность к компании", "a": 1});
mgrq.push({"cq":"Соответствие сотрудника занимаемой должности", "a": 1});
mgrq.push({"rq":"Необходимость личной беседы", "a": 2});

mgrq.push({"qh":"Рекомендации руководителя"});
mgrq.push({"q":"Комментарий ", "a": ""});

mgrq.push({"fq":"Решения и задачи на ближайший год", "a": ""});

var groups = [];
// groups.push({"n":"area 8", "m": {"17":"Pomidor Senior"}, "e":{"15":"Ivan Ivanov", "16":"Petr Petrov"}})
 groups.push({"n":"test group", "m": {"13":"Pomidor Senior", "11":"Ivan Ivanov"}, "e":{"15":"Walle Walle", "11":"Ivan Ivanov"}})
// groups.push({"n":"test group", "m": {"12":"Pomidor Senior", "10":"Ivan Ivanov"}, "e":{"14":"Walle Walle", "10":"Ivan Ivanov"}})

	
var body = {};
body['empForm'] = empq;
body['mgrForm'] = mgrq;

var Event = Backbone.Model.extend({
    urlRoot: '/tercomin/api/v1/event'
});

var t = new Event
var evnt = {}
evnt['body'] = JSON.stringify(body);
evnt['name'] = "Аттестация 2014";
evnt['groups'] = JSON.stringify(groups);

t.set('event', evnt)
t.save()

///////////////////////////////
var t = new app.Event
var body = {};
body['empForm'] = {};
body['mgrForm'] = {};
var evnt = {}
evnt['body'] = JSON.stringify(body);
evnt['name'] = "Test 2014";
t.set('event', evnt)
t.save()


////////////////////////////// delete
var t = new app.Event
t.set('id', 1)
t.destroy()