var empq = [];
empq.push({"fq":"Оценка выполнения персональных задач, поставленных на предыдущей аттестации", "a": ""});
empq.push({"fq":"Пройденное обучение", "a": ""});
empq.push({"rq":"Необходимость личной беседы", "a": 2});
empq.push({"fq":"Задачи на ближайший год", "a": ""});
empq.push({"qh":"Обратная связь"});
empq.push({"qh":"Что является Вашими сильными сторонами?"});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"q":"Другое качество ", "a": ""});

empq.push({"qh":"Что хотелось бы подтянуть?"});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"qq":"Качеcтво", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"q":"Другое качество ", "a": ""});

empq.push({"qh":"В какой мере Вы удовлетворены следующими факторами в нашей компании?"});
empq.push({"sq":"Интересность работы (проекта)", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Соответствие моей квалификации работе, которую я выполняю", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Наличие перспектив должностного продвижения", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Возможность повышения квалификации", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Информированность о делах коллектива и компании", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Бытовые условия труда", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Заработная плата", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Помощь и поддержка руководителя", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Отношения с непосредственным руководителем", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Отношения с коллегами", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"sq":"Отношения с коллегами", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});

empq.push({"qh":"События, проблемы, пожелания"});
empq.push({"q":"Какое событие прошедшего года, относящиеся к Вашей работе, является для Вас самым важным? ", "a": ""});
empq.push({"q":"Есть ли у Вас проблемы, связанные с текущими обязанностями? Какие?", "a": ""});
empq.push({"q":"Чему Вы хотели бы поучиться?", "a": ""});
empq.push({"eq":"Есть ли необходимость внутрикорпоративного обучения, обмена опытом?", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"aq":"Какой личный вклад я мог бы сделать в этом направлении:", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});

empq.push({"q":"Какие претензии у Вас есть к компании? К руководству компании?", "a": ""});
empq.push({"q":"Какие положительные изменения в компании или руководстве Вы хотели бы отметить?", "a": ""});
empq.push({"q":"Какие негативные изменения в компании или руководстве Вы хотели бы отметить?", "a": ""});
empq.push({"q":"Есть ли у Вас желание сменить проект?", "a": ""});
empq.push({"bq":"Какие льготы или поощрения Вы хотели бы получать в дополнение к заработной плате?", "a": 1});

empq.push({"eq":"Есть ли у Вас желание (необходимость) изучать английский язык?", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"eq":"Меня устраивает качество преподавания английского языка в нашей компании (и расписание)", "a": 1});
empq.push({"q":"Комментарий ", "a": ""});
empq.push({"q":"Какие прочие темы Вы хотели бы поднять на аттестации? ", "a": ""});

var mgrq = [];
mgrq.push({"qh":"Сильные стороны сотрудника"});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"q":"Другое качество ", "a": ""});

mgrq.push({"qh":"Качества сотрудника, которые стоило бы улучшить"});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"qq":"Качеcтво", "a": 1});
mgrq.push({"q":"Комментарий ", "a": ""});
mgrq.push({"q":"Другое качество ", "a": ""});

mgrq.push({"lq":"Лояльность к компании", "a": 1});
mgrq.push({"cq":"Соответствие сотрудника занимаемой должности", "a": 1});
mgrq.push({"rq":"Необходимость личной беседы", "a": 2});

mgrq.push({"qh":"Рекомендации руководителя"});
mgrq.push({"q":"Комментарий ", "a": ""});

mgrq.push({"fq":"Решения и задачи на ближайший год", "a": ""});

var groups = [];
groups.push({"n":"area 8", "m": {"17":"Pomidor Senior"}, "e":{"15":"Ivan Ivanov", "16":"Petr Petrov"}})
groups.push({"n":"test group", "m": {"17":"Pomidor Senior", "15":"Ivan Ivanov"}, "e":{"19":"Walle Walle"}})
	
var body = {};
body['empForm'] = empq;
body['mgrForm'] = mgrq;

var t = new app.Event
var evnt = {}
evnt['body'] = JSON.stringify(body);
evnt['name'] = "Аттестация 2014";
evnt['groups'] = JSON.stringify(groups);

t.set('event', evnt)
t.save()

///////////////////////////////
var t = new app.Event
var evnt = {}
evnt['name'] = "Test 2014";
t.set('event', evnt)
t.save()


////////////////////////////// delete
var t = new app.Event
t.set('id', 1)
t.destroy()